inopya/idIOT/esp8266_detector_idIOT_ v1.0_firmware/src/main.cpp
/*
 #       _\|/_   A ver..., ¿que tenemos por aqui?
 #       (O-O)
 # ---oOO-(_)-OOo---------------------------------

 ####################################################
 # ************************************************ #
 # *   MAYORDOMO VIRTUAL CON ESP8266 Y TELEGRAM   * #
 # *     idIOT  Aplicado a lavadora domestica     * #
 # *         Autor: Eulogio Lopez Cayuela         * #
 # *      Versión 1.0    Fecha: 05/12/2022        * #
 # *                                              * #
 # ************************************************ #
 ####################################################

		idIOT:   Implementing Dummy IOT

 */

 


/*mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm
//        IMPORTACION DE LIBRERIAS
//mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm*/


#include <Arduino.h>

#include <EEPROM.h>

#include <ESP8266WiFi.h>
#include <WiFiClientSecure.h>


#include <DNSServer.h>
#include <ESP8266WebServer.h>
#include <WiFiManager.h>                  //https://github.com/tzapu/WiFiManager


#include <UniversalTelegramBot.h>
#include <ArduinoJson.h>


#include <Temporizador_inopya.h>

#include "pinout.h"
#include "definiciones.h"
#include "constantes.h"
#include "enumeradores.h"
#include "variables.h"




/*mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm
//        CREACION DE OBJETOS
//mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm*/

Temporizador_inopya cronometroVirtual;

X509List cert(TELEGRAM_CERTIFICATE_ROOT);
WiFiClientSecure secured_client;
UniversalTelegramBot bot(BOT_TOKEN, secured_client);

/* gestor de conexiones y AP */
WiFiManager wifiManager;



/*mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm
//        PROTOTIPADO DE FUNCIONES
//mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm*/

void procesarTelegramas( int num_mensajes );
void enviar_cabecera( String usuario );
void eliminar_mensajes_viejos( void );
void enviar_info_luz( String );
void enviar_lista_comandos( String usuario );
void enviar_configuracion( String usuario );
void dar_hora( String usuario );

void calcular_offset( void );
void calcular_luz( void );
uint16_t control_parpadeo( void );

void update_time( void );


bool loadConfig( void );
bool saveConfig( void );


void hw_wdt_disable( void );      // Hardware WDT OFF
void hw_wdt_enable( void );       // Hardware WDT ON
void hw_wdt_timeout( uint32_t );  // Establecer TimeOut Hardware WDT




/*mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm
   ****************************************************************************************************** 
                                    FUNCION DE CONFIGURACION
   ****************************************************************************************************** 
//mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm*/

void setup()
{

	hw_wdt_enable();       // Hardware WDT ON
	hw_wdt_timeout( TIMEOUT_26_8_SEC );
	ESP.wdtFeed();

	EEPROM.begin(50);  //reserva 50 bytes para eeprom (ojo tambien los nececsitas de RAM para manejarlos)

	SERIAL_BEGIN(115200);
	PRINT_VERSION(F(_VERSION_));
	PRINTLN("");

	digitalWrite(PIN_LED_OnBoard, ONBOARD_LED_ON);

	secured_client.setTrustAnchors(&cert); // Add root certificate for api.telegram.org


	digitalWrite(PIN_LED_OnBoard, ONBOARD_LED_ON);

	  
	/* Intentar conectar i hay credenciales en la FLASH y si no... montar un AP para configuracion */ 
	wifiManager.setAPStaticIPConfig(IPAddress(192,168,5,1), IPAddress(192,168,5,1), IPAddress(255,255,255,0));
	delay(1000);
	wifiManager.autoConnect(SSID_PORTAL, PASS_PORTAL);          // portal de configuracion si no podemos conectar

	digitalWrite(PIN_LED_OnBoard, ONBOARD_LED_OFF);     
	PRINT(F("\nWiFi conectada. IP address: "));
	PRINTLN(WiFi.localIP()); PRINTLN(F("\n\n"));

	PRINTLN(F("Actualizando fecha/hora: "));
	configTime("GMT-2", "pool.ntp.org", "time.nist.gov");   //
	time_t now = time(nullptr);
	while (now < 24 * 3600) {
		PRINT(".");
		delay(1000);
		now = time(nullptr);
	}

	PRINTLN("");
	update_time();
	PRINTLN(fecha_hora);
	PRINTLN("\n");


	enviar_cabecera(ADMIN_USER);
	PRINTLN_DEBUG(F("cabecera enviada")); 

	eliminar_mensajes_viejos();
	delay(250);

	PRINTLN_DEBUG(F("mensajes viejos borrados")); 

	/* calculo del  umbral luminoso del ambiente */
	calcular_offset();

	ESP.wdtDisable();       // Software WDT OFF

	loadConfig();
	enviar_configuracion(ADMIN_USER);
	
	FLAG_reinicio = false; 
	estado_actual = user_mode;
}



/*mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm
   ****************************************************************************************************** 
                                  BUCLE PRINCIPAL DEL PROGRAMA
   ****************************************************************************************************** 
//mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm*/




void loop()
{
	ESP.wdtFeed();  //para el WDT software/hardware. Tenemos habilitado solo el WDT hardware

	uint32_t momento_actual = millis();

	if ( momento_actual - ultimo_acceso > INTERVALO_ACCESO_SERVIDOR) {
		int num_mensajes_pendientes = bot.getUpdates(bot.last_message_received + 1);

		while (num_mensajes_pendientes) {
			procesarTelegramas(num_mensajes_pendientes);
			num_mensajes_pendientes = bot.getUpdates(bot.last_message_received + 1);
		}
		ultimo_acceso = momento_actual;
	}



	/* ===== MAQUINA DE ESTADOS - (Toma de decisiones) ===== */

	switch(estado_actual)
	{
		case MODE_OFF:    //modo reposo tras inicio del sistema o finalizar proceso 
			estado_actual=MODE_OFF;
		break;
	  
	  
