inopya/idIOT/esp8266_detector_idIOT_ v1.0_firmware/src/main.cpp
		case MODE_RUN:   //inicio de tarea, calcula luz ambiente e inicia el modo de operacion seleccionado
			calcular_offset();
			estado_actual=user_mode;
		break; 
		
		
		case MODE_DETECT_ON:           //buscar encendido de luz
			calcular_luz();
			if( rectificado_A0 > umbral_luz ){ 
				mensaje = "LUZ DETECTADA: ";
				mensaje += String(rectificado_A0);
				estado_actual = MODE_END_TASK; 

				PRINTLN_DEBUG(mensaje);
			}
		break; 
		
		
		case MODE_DETECT_OFF:           //buscar apagado de luz
			calcular_luz();
			if( (offSet - valor_entrada_A0) > umbral_oscuro ){ 
				mensaje = "OSCURIDAD DETECTADA: ";
				mensaje += String(valor_entrada_A0 - offSet);
				estado_actual = MODE_END_TASK;

				PRINTLN_DEBUG(mensaje);
			}
		break;
		
		
		case MODE_DETECT_BLINK:           //buscar parpadeos de luz
			calcular_luz();
			control_parpadeo();
			if( contador_parpadeos > num_parpadeos ){ 
				contador_parpadeos = 0;
				mensaje = "BLINK DETECTADO: ";
				estado_actual = MODE_END_TASK; 
			}
		break;	
		
		
		case MODE_END_TASK:           //notificar el fin una tarea
			digitalWrite(PIN_LED_OnBoard, ONBOARD_LED_ON);
			mensaje += "\n\nTAREA FINALIZADA: ";
			bot.sendMessage( ADMIN_USER, mensaje);
			mensaje = "";
			PRINTLN_DEBUG(F("Notificacion Enviada"));
			delay(500);
			digitalWrite(PIN_LED_OnBoard, ONBOARD_LED_OFF); 

			if(FLAG_repetir_notificacion){  //TO-DO  -- falta implementar en telegram
				cronometroVirtual.begin(15000);
				estado_actual = MODE_WAIT;
			}
			else{ estado_actual = MODE_STOP; }
		break;


		case MODE_WAIT:           //tiempo de espera para repetir notificacion
			if ( cronometroVirtual.estado()==false ){
				PRINTLN_DEBUG(F("Fin de espera"));  
				contador_parpadeos = 0;  // por si el modo es blink, para reiniciar un nuevo conteo de parpadeos
				estado_actual = user_mode;  
			}
		break;


		case MODE_STOP:  // fin de notificaciones
			mensaje = "<<FIN DE EVENTO>>\nNotificaciones CANCELADAS\nEsperando nueva orden...";
			bot.sendMessage( ADMIN_USER, mensaje);
			estado_actual=MODE_OFF;
		break;


		default :
			estado_actual=MODE_OFF;
		break;       
	}
  
}








/*mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm
   xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx 
        BLOQUE DE FUNCIONES: LECTURAS DE SENSORES, COMUNICACION SERIE, INTERRUPCIONES...
   xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx 
//mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm*/


/*mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm
//    LDR
//mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm*/

//========================================================
// calcular luz ambiente
//========================================================

void calcular_offset( void )
{
	offSet=0;

	for(uint8_t n=0;n<8;n++){
		offSet += analogRead(PIN_LDR);
		delay(125);
	}

	offSet  = (offSet >> 3);   //dividir entre 8 (entero)
}


//========================================================
// medicion luz
//========================================================

void calcular_luz( void )
{
	valor_entrada_A0 = analogRead(PIN_LDR);
	rectificado_A0= valor_entrada_A0 - offSet;
	rectificado_A0 = constrain(rectificado_A0, -1023, 1023);
}



//========================================================
// Contador de parpadeos
//========================================================

uint16_t control_parpadeo( void )
{
	//static uint16_t contador_parpadeos;  //sacada a global para poder resetearla
	static uint8_t estado_blink_anterior = OFF;
	uint8_t estado_blink_actual;
  
	if( rectificado_A0 > umbral_luz ){ estado_blink_actual = ON; }
	else{ estado_blink_actual = OFF; }
	
	if( estado_blink_actual != estado_blink_anterior ){
		contador_parpadeos++;
		estado_blink_anterior = estado_blink_actual;
	}
	
	return contador_parpadeos;
}



/*mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm
//    EEPROM
//mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm*/


//========================================================
// LEER DE EEPROM DATOS DE CUALQUIER TIPO
//========================================================
template <typename T> unsigned int eeprom_load (int _memory_pos, T& _value)
{
	byte* p = (byte*)&_value;
	uint16_t i;
	for (i = 0; i < sizeof(_value); i++)
		*p++ = EEPROM.read(_memory_pos++);
	return i;
}


//========================================================
// GRABAR EN EEPROM DATOS DE CUALQUIER TIPO
//========================================================

template <typename T> unsigned int eeprom_save(int _memory_pos, const T& _value)
{
	const byte* p = (const byte*)&_value;
	uint16_t i;
	for (i = 0; i < sizeof(_value); i++)
		EEPROM.write(_memory_pos++, *p++);
	return i;
}

//========================================================
// LEER CONFIGURACION
//========================================================

bool loadConfig( void )
{
	eeprom_load(POS_MEM_UMBRAL_LUZ, umbral_luz);
	eeprom_load(POS_MEM_UMBRAL_OSCURIDAD, umbral_oscuro);
	eeprom_load(POS_MEM_NUM_PARPADEOS, num_parpadeos);

	uint16_t variable_1;
	eeprom_load(POS_MEM_UMBRAL_LUZ, variable_1);
	
	if( variable_1!=umbral_luz ){
		PRINTLN_DEBUG(F("DEBUG: Error load EEPROM"));
		return false;
	}
  
	return true;
}


//========================================================
// SALVAR CONFIGURACION
//========================================================

bool saveConfig( void )
{
	eeprom_save(POS_MEM_UMBRAL_LUZ, umbral_luz);
	eeprom_save(POS_MEM_UMBRAL_OSCURIDAD, umbral_oscuro);
	eeprom_save(POS_MEM_NUM_PARPADEOS, num_parpadeos);
	
	EEPROM.commit();	//guarda la informacion en la EEPROM
					
	uint16_t variable_1;
	delay(100);
	eeprom_load(POS_MEM_UMBRAL_LUZ, variable_1);
	
	if( variable_1!=umbral_luz ){
		PRINTLN_DEBUG(F("DEBUG: Error save EEPROM"));
		return false;
	}
  
