inopya/idIOT/esp8266_detector_idIOT_ v1.0_firmware/src/main.cpp
	return true;
}






/*mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm
//    TELEGRAM
//mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm*/

//========================================================
// PROCESAR TELEGRAMAS RECIBIDOS
//========================================================

void procesarTelegramas(int num_mensajes)
{
	for (int i = 0; i < num_mensajes; i++) {

		String from_name = bot.messages[i].from_name;    //para compatibilidad con una funcion antigua. 
		String chat_id = bot.messages[i].chat_id;        //para compatibilidad con una funcion antigua. 
		String text = bot.messages[i].text;              //para compatibilidad con una funcion antigua. 

		//if (chat_id != ADMIN_USER && chat_id != OTHER_USER) { 
		  PRINT_DEBUG(F("   >>> USUARIO: ")); 
		  PRINTLN_DEBUG( chat_id );
		  PRINT_DEBUG(F("   >>> NOMBRE:  ")); 
		  PRINTLN_DEBUG( from_name );    
		  PRINT_DEBUG(F("   >>> COMANDO: ")); 
		  PRINTLN_DEBUG( text );
		  PRINTLN_DEBUG(F("----------------------\n"));
		//}

		if (text == "/start") {
			String welcome = "Bienvenido a Control idIoT, " + from_name + ".\n\n";
			welcome += "/opciones : lista de comandos\n";

			bot.sendMessage(chat_id, welcome, "Markdown");

			String keyboardJson = "[[\"/opciones\", \"/teclado\"]";
			if (chat_id==ADMIN_USER || chat_id==OTHER_USER){
			keyboardJson+=",[\"/fecha\",\"/hora\"],[\"/offset\",\"/config\",\"/luz\"]";
			 keyboardJson+=",[\"/red\",\"/version\"],[\"/AP_reset\",\"/update\"]";
			keyboardJson+=",[\"/on\",\"/off\",\"/blink\"], [\"/repeat\",\"/stop\",\"/run\"]" ;
			}
			keyboardJson+="]";  // fin de Keyboard;
			bot.sendMessageWithReplyKeyboard(chat_id, " # Usa la lista de comandos o el teclado...", "", keyboardJson, true); 
			enviar_lista_comandos(chat_id);
		}

		else if (text == "/opciones") { enviar_lista_comandos(chat_id); }

		else if (text == "/teclado") { 
			String NokeyboardJson = "";
			String keyboardJson = "[[{\"text\":\"hora\",\"callback_data\":\"/hora\"},\
								   {\"text\":\"fecha\",\"callback_data\":\"/fecha\"}],\
								  [{\"text\":\"establecer Offset\",\"callback_data\":\"/offset\"},\
								   {\"text\":\"Configuracion\",\"callback_data\":\"/config\"},\
								   {\"text\":\"estado LDR\",\"callback_data\":\"/ldr\"}]";
								  
			if (chat_id==ADMIN_USER || chat_id==OTHER_USER){
				keyboardJson+=",[{\"text\":\"RED\",\"callback_data\":\"/red\"},\
								 {\"text\":\"VERSION\",\"callback_data\":\"/version\"}],\
								[{\"text\":\"AP Reset\",\"callback_data\":\"/AP_reset\"},\
								 {\"text\":\"Update Firmware\",\"callback_data\":\"/update\"}],\
								[{\"text\":\"Detect ON\",\"callback_data\":\"/on\"},\
								 {\"text\":\"Detect OFF\",\"callback_data\":\"/off\"},\
								 {\"text\":\"Detect BLINK\",\"callback_data\":\"/blink\"}],\
								[{\"text\":\"Notificacion\",\"callback_data\":\"/repeat\"},\
								 {\"text\":\"STOP\",\"callback_data\":\"/stop\"},\
								 {\"text\":\"RUN\",\"callback_data\":\"/run\"}]";

			}
			keyboardJson += "]";  // fin de Keyboard;
			bot.sendMessageWithInlineKeyboard(chat_id, "...","", keyboardJson);
		}    
				
		else if ( text == "/AP_reset" && ( chat_id==ADMIN_USER || chat_id==OTHER_USER) ) { 
			bot.sendMessage(chat_id, "Borrando redes WiFi,\nMontando AP y reiniciando...");
			wifiManager.resetSettings();
			delay(2000);
			ESP.restart(); 
		}
			
		else if (text == "/update" && ( chat_id==ADMIN_USER || chat_id==OTHER_USER) ) { 
			bot.sendMessage(chat_id, "Montando AP para actualizar...\nEntra en: http://192.168.5.1");
			wifiManager.setAPStaticIPConfig(IPAddress(192,168,5,1), IPAddress(192,168,5,1), IPAddress(255,255,255,0));
			wifiManager.startConfigPortal(SSID_PORTAL, PASS_PORTAL);  // forzar portal de configuracion
			delay(1000);
		}

		  
		else if ( text.equals("/red") && (chat_id == ADMIN_USER || chat_id == OTHER_USER) ) { 
			enviar_cabecera( chat_id );
		} 

		else if ( text.equals("/hora") || text.equals("/time") || text.equals("/fecha") || text.equals("/date") ) { 
			dar_hora( chat_id );
		}

		else if ( (text.equals("/ver") || text.equals("/version")) && (chat_id == ADMIN_USER || chat_id == OTHER_USER) ) { 
			FLAG_version=true;
			enviar_cabecera( chat_id );
		}

		else if ( (text.equals("/ldr") || text.equals("/luz") || text.equals("/info")) && (chat_id == ADMIN_USER || chat_id != OTHER_USER) ) { 
			enviar_info_luz( chat_id );
		} 
		else if ( (text.equals("/offset") ) && (chat_id == ADMIN_USER || chat_id == OTHER_USER) ) { 
			calcular_offset(); 

			mensaje = "offSet luz ambiente: ";
			mensaje += String(offSet);
			if(offSet<OFFSET_MIN) { mensaje += "\n ** Detecciones OFF pueden ser complicadas **"; }  //< >
			else if(offSet>OFFSET_MAX) { mensaje += "\n ** Detecciones ON y BLINK pueden ser complicadas **"; }
			PRINTLN_DEBUG(mensaje); 
			bot.sendMessage(chat_id, mensaje); 
			mensaje = "";

			enviar_info_luz( chat_id );
		}

		else if ( (text.equals("/on") ) && (chat_id == ADMIN_USER || chat_id == OTHER_USER) ) { 
			user_mode = MODE_DETECT_ON; 
			bot.sendMessage(chat_id, "MODO: Detectar ENCENDIDO");
		}
		else if ( (text.equals("/off") ) && (chat_id == ADMIN_USER || chat_id == OTHER_USER) ) { 
			user_mode = MODE_DETECT_OFF; 
			bot.sendMessage(chat_id, "MODO: Detectar APAGADO");
		}
		else if ( (text.equals("/blink") ) && (chat_id == ADMIN_USER || chat_id == OTHER_USER) ) { 
			user_mode = MODE_DETECT_BLINK; 
			bot.sendMessage(chat_id, "MODO: Detectar PARPADEO");
		}
		else if ( (text.equals("/run") ) && (chat_id == ADMIN_USER || chat_id == OTHER_USER) ) { 
			estado_actual = MODE_RUN; 
			bot.sendMessage(chat_id, "Tarea INICIADA");
		}
		else if ( (text.equals("/stop") ) && (chat_id == ADMIN_USER || chat_id == OTHER_USER) ) { 
			estado_actual = MODE_STOP; 
		}
		else if ( (text.equals("/repeat") ) && (chat_id == ADMIN_USER || chat_id == OTHER_USER) ) { 
			//if(estado_actual!=user_mode){ 
				FLAG_repetir_notificacion = !FLAG_repetir_notificacion;
				mensaje = "Repetir notificaciones: ";
				if( FLAG_repetir_notificacion ) { mensaje+="ON"; }
				else { mensaje+="OFF"; }
				PRINT_DEBUG(mensaje);
				bot.sendMessage(chat_id, mensaje);
			//}
		}
		else if ( (text.equals("/config") )  && (chat_id == ADMIN_USER || chat_id == OTHER_USER) ) { 
			//if(estado_actual!=user_mode){ 
			enviar_configuracion(chat_id);
			//}
		}
		else if ( (text.substring(0,4) == "/cfg")  && (chat_id == ADMIN_USER || chat_id == OTHER_USER) ) { 
			if(estado_actual!=user_mode){ 
				int16_t consigna = text.substring(4).toInt();
				if (user_mode == MODE_DETECT_ON) { umbral_luz = consigna; }
				if (user_mode == MODE_DETECT_OFF) { umbral_oscuro = consigna; } 
				if (user_mode == MODE_DETECT_BLINK) { num_parpadeos = consigna; } 
				saveConfig();
				bot.sendMessage( chat_id, "Nueva consigna establecida" );  
			}
		}    
		else{ bot.sendMessage( chat_id, "ok" ); }
  }
}




//========================================================
// ENVIAR CONFIGURACION ACTUAL
//========================================================

