inopya/idIOT/esp8266_detector_idIOT_ v1.0_firmware/src/main.cpp
void enviar_configuracion(String usuario)
{ 
	mensaje="umbral luz: ";
	mensaje+=String(umbral_luz);
	mensaje+="\numbral oscuro: ";
	mensaje+=String(umbral_oscuro);
	mensaje+="\nnum parpadeos: ";
	mensaje+=String(num_parpadeos);
	bot.sendMessage( usuario, mensaje );  
}

//========================================================
// ENVIAR INFORMACION DE LUZ ACTUAL
//========================================================

void enviar_info_luz(String usuario)
{
	calcular_luz();
	mensaje = "OffSet: ";
	mensaje += String(offSet);
	mensaje += "  >> A0: ";

	mensaje += String(valor_entrada_A0);
	mensaje += "  -->  UMBRAL: ";
	mensaje += String(rectificado_A0);
	bot.sendMessage(usuario, mensaje);
}



//========================================================
// ENVIAR MENSAJE CON LA LSITA DE COMANDOS
//========================================================

void enviar_lista_comandos(String usuario)
{
	String info_comandos = "LISTA DE COMANDOS:\n";
	info_comandos += "/opciones : Muestra esta ayuda\n";
	info_comandos += "/teclado : Teclado en pantalla\n";
	info_comandos += "/offset : Establece luz ambiente\n";
	info_comandos += "/luz : Ver nivel luminoso actual\n";
	info_comandos += "/fecha : Muestra la fecha y la hora\n";
	info_comandos += "/hora : Muestra la fecha y la hora\n";
	info_comandos += "/repeat : On/Off Repetir Notificaciones \n";
	info_comandos += "/config : Muestra el umbral actual\n";
    info_comandos += "/cfgxxx : Modifica el umbral/num parpadeos\n";
	
	if( usuario==ADMIN_USER || usuario==OTHER_USER ){    
		info_comandos += "/red : Informacion de CONEXION\n";
		info_comandos += "/version : Muestra la VERSION de firmware\n";
		info_comandos += "/on : detectar ENCENDIDO\n";
		info_comandos += "/off : detectar APAGADO\n";
		info_comandos += "/blink : detectar PARPADEOS\n";
		info_comandos += "/run : INICIAR tarea seleccionada\n";
		info_comandos += "/stop : CANCELAR tarea y/o notificaciones\n";

		info_comandos += "/AP_reset : RESET de credenciales wifi\n";
		info_comandos += "/update : Entra en modo UPDATE\n";
	}
  
	bot.sendMessage( usuario, info_comandos );     
}


//========================================================
// ENVIAR CABECERA CON DATOS DE CONEXION
//========================================================

void enviar_cabecera(String usuario)
{
	String local_ip = String() + WiFi.localIP()[0] + "." + WiFi.localIP()[1] + "." + WiFi.localIP()[2] + "." + WiFi.localIP()[3];

	String cabecera = "";
	cabecera += "ID STATION: ";
	cabecera += ID_STATION;
	cabecera += "\n"; 
	if( FLAG_reinicio || FLAG_version ){
		cabecera += "BOT: ";
		cabecera +=_VERSION_;
		cabecera += "\n";
		cabecera += "FIRMWARE: ";
		cabecera +=_FIRMWARE_;
		cabecera += "\n";    
		if( FLAG_version ){
			FLAG_version=false;
			bot.sendMessage( usuario, cabecera );
			return;
		}
	}
	cabecera += "Conectado a: ";
	cabecera +=  WiFi.SSID();
	cabecera += "\n";
	cabecera += "IP: ";
	cabecera += local_ip;
	cabecera += "\n";
  
	if(FLAG_reinicio){
		update_time();
		cabecera += fecha_hora;
	}
	bot.sendMessage( usuario, cabecera );
}


//========================================================
// ENVIAR FECHA Y HORA DEBUG
//========================================================

void dar_hora(String usuario)
{
	update_time();
	fecha_hora = "Fecha/Hora:  " + fecha_hora;
	bot.sendMessage( usuario, fecha_hora );
}


//========================================================
// ACTUALIZAR FECHA Y HORA
//========================================================

void update_time()
{ 
	time_t now = time(nullptr);  
	const char *date_time = ctime(&now); 
	String fecha = String(date_time);

	fecha_hora="";

	fecha_hora += fecha.substring(0, 4);    //'wed '
	fecha_hora += fecha.substring(8, 11);   //'14 '
	fecha_hora += fecha.substring(4, 8);    //'Jul '
	fecha_hora += fecha.substring(20,24);   //'2021'
	fecha_hora += " / ";
	fecha_hora += fecha.substring(11, 19);  //'hora... '
}




//========================================================
// ELIMINAR TELEGRAMAS VIEJOS AL REINICIAR
//========================================================

void eliminar_mensajes_viejos()
{
	int num_mensajes_pendientes = bot.getUpdates(bot.last_message_received + 1);
	while (num_mensajes_pendientes) {
		PRINT_DEBUG(F("Borrando basura... ")); 
		PRINTLN_DEBUG(bot.messages[num_mensajes_pendientes].text);
		num_mensajes_pendientes = bot.getUpdates(bot.last_message_received + 1);
	}
}




/*mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm
//       CONTROL DEL WACTH DOG TIMER
//mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm*/

//========================================================
// DESHABILITAR WACTH DOG TIMER HARDWARE
//========================================================

void hw_wdt_disable(){
	*((volatile uint32_t*) WDT_TIMEOUT_REG) &= ~(1); // Hardware WDT OFF
}


//========================================================
// HABILITAR WACTH DOG TIMER HARDWARE
//========================================================

void hw_wdt_enable(){
	*((volatile uint32_t*) WDT_TIMEOUT_REG) |= 1; // Hardware WDT ON
}


//========================================================
// ESTABLECER TIMEOUT PARA WACTH DOG TIMER HARDWARE
//========================================================

void hw_wdt_timeout(uint32_t _timeout)
{
	//WRITE_REG(WDT_TIMEOUT_REG, _timeout); 
	(*((volatile uint32_t *)(WDT_TIMEOUT_REG))) = (uint32_t)(_timeout);
}




//*******************************************************
//                    FIN DE PROGRAMA
//*******************************************************
